#include <stdio.h>
//Завдання: Определити чи є число простим
//Автор: Ветріченко Дарина Ігорівна
//Група: КН-924з

int main() {
    int number;
    int isPrime; // Змінна для зберігання інформації про простоту числа

    // Введення числа
    printf("Введіть ціле число: ");
    scanf("%d", &number);

    // Перевірка на те, чи є число протимб
    if (number <= 1) {
        isPrime = 0; // Числа менше або рівне 1 не є простими
    } else {
        isPrime = 1; // Припускаємо, що число просте
        int i = 2; // Початковий дільник

        // Використання циклу do while для перевірки дільників
        do {
            if (number % i == 0) {
                isPrime = 0; // Якщо число ділиться на i, то воно не просте
                break; // Виходимо з циклу
            }
            i++; // Переходимо до наступного дільника
        } while (i * i <= number); // Продовжуємо, поки i не перевищить квадратний корінь з number
    }

    // Виведення результату
    if (isPrime) {
        printf("%d є простим числом.\n", number);
    } else {
        printf("%d не є простим числом.\n", number);
    }

    return 0; // Завершення програми
}